## 使用docker 安装redis

- 拉取镜像`docker pull redis`
- 运行redis: `docker run --name myredis -d -p6380:6379 redis`
  - -d 后台运行 返回docker ID
  - -p6380:6379 ： 6380 是本地的端口 6379 是容器内部的端口
- 执行redis
```
redis-cli -p 6380
执行容器中的 redis-cli：docker exec -it myredis redis-cli
```

> 拉取镜像的时候报错：

```err
Error response from daemon: Get https://registry-1.docker.io/v2/library/redis/manifests/latest: unauthorized: incorrect username or password
Error response from daemon: Get https://registry-1.docker.io/v2/: net/http: request canceled while waiting for connection (Client.Timeout exceeded while awaiting headers)
```

> 解决问题：  

使用阿里云的镜像

https://7bjydfag.mirror.aliyuncs.com

阿里云镜像后台 https://cr.console.aliyun.com/cn-hangzhou/instances/mirrors


- [参考](https://segmentfault.com/a/1190000016083023?utm_source=tag-newest)
- [Docker命令详解（run篇）](https://www.cnblogs.com/yfalcon/p/9044246.html)

> Docker 重名问题   
https://blog.csdn.net/u012129607/article/details/79616547

```
docker: Error response from daemon: Conflict. The container name "/test-redis" is already in use by container "a578b5ebf445a0fed037ff86476473237c11a43b62e75f788b0fc05685f18c09". You have to remove (or rename) that container to be able to reuse that name.
```

```
docker ps -a
docker restart test_redis
```

```
通过dig @114.114.114.114 registry-1.docker.io找到可用IP
;; ANSWER SECTION:
registry-1.docker.io.	60	IN	A	54.165.149.19
registry-1.docker.io.	60	IN	A	34.233.151.211
##
registry-1.docker.io.	60	IN	A	52.22.201.61
registry-1.docker.io.	60	IN	A	52.54.155.177
registry-1.docker.io.	60	IN	A	52.206.40.44
registry-1.docker.io.	60	IN	A	52.70.175.131
registry-1.docker.io.	60	IN	A	34.206.236.31
registry-1.docker.io.	60	IN	A	52.22.67.152
```
```
sudo vim/etc/hosts强制docker.io相关的域名解析到其它可用IP
54.165.149.19 registry-1.docker.io
```
> 测试：

```
docker search redis

hzx:~ mac$ docker search redis
NAME                              DESCRIPTION                                     STARS               OFFICIAL            AUTOMATED
redis                             Redis is an open source key-value store that…   6304                [OK]
bitnami/redis                     Bitnami Redis Docker Image                      99                                      [OK]
sameersbn/redis                                                                   75                                      [OK]
grokzen/redis-cluster             Redis cluster 3.0, 3.2, 4.0 & 5.0               39
hypriot/rpi-redis                 Raspberry Pi compatible redis image             34
kubeguide/redis-master            redis-master with "Hello World!"                27
kubeguide/guestbook-redis-slave   Guestbook redis slave                           22
redislabs/redis                   Clustered in-memory database engine compatib…   19
```

### 使用 DaoCloud 提供的镜像

[DaoCloud](https://www.daocloud.io/mirror#accelerator-doc)

```
右键点击桌面顶栏的 docker 图标，选择 Preferences ，在 Daemon 标签（Docker 17.03 之前版本为 Advanced 标签）下的 Registry mirrors 列表中加入下面的镜像地址:
http://141e5461.m.daocloud.io
点击 Apply & Restart 按钮使设置生效。
```


## Redis 基础数据结构

- 字符串String
- 列表List
- 哈希Hash
- 集合Set
- 有序集合Zset

查看key的类型：type keyname

### String 字符串

Redis 中的数据结构都是以唯一的字符串为key,通过key获取value的值。 **不同数据类型结构的差异在于value结构的不一样**    
Redis 是动态字符串，通过**预分配冗余空间的方式**，防止内存的频繁分配。cap>len    

字符串<1M 时，加倍扩容。字符串长度>1M,每次最多扩容1M，注意字符串总长度不超过512M 

####  键值对

```
127.0.0.1:6380> set aa bb
OK
127.0.0.1:6380> get aa
"bb"
127.0.0.1:6380> exists aa
(integer) 1
127.0.0.1:6380> exists aa
(integer) 1
127.0.0.1:6380> del aa
(integer) 1
127.0.0.1:6380> get aa
(nil)
127.0.0.1:6380>
```

```py
print r.exists('name1')  # 1 为存在
print r.exists('hello')  # 0 是不存在
print r.get("hello") # 有则返回相应的值 没有则返回None
```

#### 批量键值对

批量对多个键值对进行读写，可以节省网络开销
```
127.0.0.1:6380> set name1 aa
OK
127.0.0.1:6380> set name2 bb
OK
127.0.0.1:6380> set name3 cc
OK
127.0.0.1:6380> mget name1 name2 name3
1) "aa"
2) "bb"
3) "cc"
127.0.0.1:6380>mset m1 m1 m2 m2
OK
```
在Python中批量获取，没有相应key,结果是None
```python
# coding:utf-8
from __future__ import unicode_literals

import redis

pool = redis.ConnectionPool(host='127.0.0.1',port='6380')

r = redis.Redis(connection_pool=pool)
print r.mget('name1', 'name2', 'aaa')
# 结果：['aa', 'bb', None]
```

#### 过期和set 命令扩展

- 设置过期时间

```
expire key seconds
setex key seconds value
```

```
127.0.0.1:6380> get m1
"m1"
127.0.0.1:6380> expire m1 3 
(integer) 1
127.0.0.1:6380> get m1
(nil)
127.0.0.1:6380> setex m3 5 m3 # 3s 后过期，等价于 set+expire
OK
127.0.0.1:6380> get m3
"m3"
127.0.0.1:6380> get m3
(nil)
```
- setnx key value 已经存在则不创建
```
127.0.0.1:6380> setnx name name-value
(integer) 1 # 如果 name 不存在就执行 set 创建
127.0.0.1:6380> get name
"name-value"
127.0.0.1:6380> setnx name aaaa
(integer) 0 # 因为 name 已经存在，所以 set 创建不成功
127.0.0.1:6380> get name
"name-value"
```

- getrange
- setrange
```
127.0.0.1:6380> get name
"hello"
127.0.0.1:6380> getrange name 0 1  # key-name 启始字节 结束字节 
"he"
127.0.0.1:6380> getrange name 0 3
"hell"
127.0.0.1:6380> getrange name 0 5
"hello"
127.0.0.1:6380> getrange name 0 8
"hello"
127.0.0.1:6380> get name
"hello"
127.0.0.1:6380> setrange name 0 world111  #  修改字符串内容，从指定字符串索引开始向后替换（新值太长时，则向后添加）
(integer) 8
127.0.0.1:6380> get name
"world111"
```

#### 计数

当value时**整数**的时候，可以进行自增、自减操作。但是是有范围的，不能超过singedLong的最大最小值，否则会报错` ERR increment or decrement would overflow`

```
127.0.0.1:6380> set age 30
OK
127.0.0.1:6380> get age
"30"
127.0.0.1:6380> incr age
(integer) 31
127.0.0.1:6380> decr age
(integer) 30
127.0.0.1:6380> incrby age 10  # 自增任意值
(integer) 40
127.0.0.1:6380> get age
"40"
127.0.0.1:6380> decrby age 15
(integer) 25
127.0.0.1:6380> set test_max 9223372036854775807  # long long 最大值
OK
127.0.0.1:6380> incr test_max
(error) ERR increment or decrement would overflow

127.0.0.1:6380> set test_min -9223372036854775808 # long long 最小值
OK
127.0.0.1:6380> decr test_min
(error) ERR increment or decrement would overflow
```

字符串长度参考：

longlong 的范围：-2^63(-9223372036854775808 )------2^63-1 ( 9223372036854775807（9.2*10E18）)  

https://blog.csdn.net/leibniz_zhang/article/details/52150697

### List

Redis中的List是链表而非数组，插入和删除的速度很快，时间复杂度是`O(1)`,索引比较慢，时间复杂度是`O(n)`

扩展阅读：   
链表在内存中是堆，是树，插入和删除很快
数组在内存中是栈，（一级缓存，通常自动分配），索引很快a[i],但是在插入和删除的时候需要操作其他元素，插入和删除的时间复杂度是`O(n)`

数组静态分配内存，链表动态分配内存；

数组在内存中连续，链表不连续；

数组元素在栈区，链表元素在堆区；

数组利用下标定位，时间复杂度为O(1)，链表定位元素时间复杂度O(n)；

数组插入或删除元素的时间复杂度O(n)，链表的时间复杂度O(1)。

https://www.cnblogs.com/harvey888/p/6653916.html
https://zhidao.baidu.com/question/923023176197990819.html

队列操作是先进先出FIFO

rpush  lpop

lpush rpop

llen name # 查看列表长度

lrange books 0 100 # 查看列表范围

```
> rpush books python java golang
(integer) 3
> llen books
(integer) 3
> lpop books
"python"
> lpop books
"java"
> lpop books
"golang"
> lpop books
(nil)
```



栈操作 是先进后出 FILO

```
> rpush books python java golang
(integer) 3
> rpop books
"golang"
> rpop books
"java"
> rpop books
"python"
> rpop books
(nil)
```



```
127.0.0.1:6379> rpush books python java golang
(integer) 3
127.0.0.1:6379> lrange books 0 100
1) "python"
2) "java"
3) "golang"
```

#### 慢操作

`lindex`会对链表进行遍历，随着参数的变多，性能变差    时间复杂度是O(n) 慎用
`ltrim`从字面的意思是剪切，会将选定范围的保留下来  

ltrim 跟的两个参数`start_index`和`end_index`定义了一个区间，在这个区间内的值，ltrim 要保留，区间之外统统砍掉。我们可以通过ltrim来实现一个定长的链表，这一点非常有用。

index 可以为负数， index=-1代表最后一个元素

```
127.0.0.1:6379> rpush books python java golang
(integer) 3
127.0.0.1:6379> lindex books 1  # 时间复杂度O(n)慎用
"java"
127.0.0.1:6379> lindex books 0
"python"
127.0.0.1:6379> lindex books -1  # 查询最后一个元素
"golang"
```

```
127.0.0.1:6379> ltrim books 1 1  # 只保留了第一个
OK
127.0.0.1:6379> lrange books 0 -1 # 获取所有元素O(n)慎用
1) "java"
127.0.0.1:6379> ltrim books -1 0  # 相当于清空列表 区间范围长度为0 选从最后一个元素裁剪 裁剪0个
OK
127.0.0.1:6379> llen books
(integer) 0
```

#### 快操作

Redis 底层存储的是`快速链表` Quicklist

在列表元素较少的情况下会使用一块连续的内存，该结构是`ziplist`，即压缩列表，元素紧挨着，分配的是一块连续的内存。当元素较多的时候才会变成quicklist。redis 将多个ziplist结合起来组成了quicklist(使用双向指针将多个ziplist串联起来)，既满足了快速插入删除的功能，又不会出现太大的空间冗余

```
graph LR
  a[ziplist]-->b[ziplist]
  b[ziplist]-->c[ziplist]
  c[ziplist]-->d[ziplist]
  b-->a
  c-->b
  d-->c
```


#### Python List 操作

```
# 使用yield 对列表元素增量迭代  

def redis_list_itre(name):
    """
    :param name: redis列表
    :return yield:
    """
    if r.type(name) == "list":
        list_count = r.llen(name)
        for index in range(list_count):
            yield r.lindex(name, index)
    else:
        print "%s is not list type" %name
 
for item in redis_list_itre("class"):
    print item
```

### Hash

Redis 的字典的值只能是字符串



hash是无序字典，是数组+链表的二维结构

- hset
- hget 新增返回1 更新返回0
- hgetall
- hmset
- hmget
- hdel

hash中最后一个元素被移除后，该数据结构自动被删除，内存被回收


```
127.0.0.1:6379> hgetall books
1) "java"
2) "think in java"
3) "golang"
4) "concurrent in go"
5) "python"
6) "python"
```

#### 计数

在hash结构中，单个key可以计数，hincrby 和incr/incrby一样
```
127.0.0.1:6379> hincrby self age 1
(integer) 19
127.0.0.1:6379> hget self age
"19"
127.0.0.1:6379> hincrby self age 10 # 指定任意的数字
(integer) 29
```



### Set 集合

Redis 的集合相当于 Java 语言里面的 HashSet，它内部的键值对是无序的唯一的。它的内部实现相当于一个特殊的字典，字典中所有的 value 都是一个值`NULL`。

当集合中最后一个元素移除之后，数据结构自动删除，内存被回收。

应用：

set 结构可以用来存储活动中奖的用户 ID，因为有去重功能，可以保证同一个用户不会中奖两次。

```
> sadd books python
(integer) 1
> sadd books python  #  重复
(integer) 0
> sadd books java golang
(integer) 2
> smembers books  # 注意顺序，和插入的并不一致，因为 set 是无序的
1) "java"
2) "python"
3) "golang"
> sismember books java  # 查询某个 value 是否存在，相当于 contains(o)
(integer) 1
> sismember books rust
(integer) 0
> scard books  # 获取长度相当于 count()
(integer) 3
> spop books  # 弹出一个
"java"
```



### Zset(有序集合)

zset 可能是 Redis 提供的最为特色的数据结构，它也是在面试中面试官最爱问的数据结构。它类似于 Java 的 SortedSet 和 HashMap 的结合体，一方面它是一个 set，保证了内部 value 的唯一性，另一方面它可以给每个 value 赋予一个 score，代表这个 value 的排序权重。它的内部实现用的是一种叫做「跳跃列表」的数据结构。

zset 中最后一个 value 被移除后，数据结构自动删除，内存被回收。

zset 可以用来存粉丝列表，value 值是粉丝的用户 ID，score 是关注时间。我们可以对粉丝列表按关注时间进行排序。

zset 还可以用来存储学生的成绩，value 值是学生的 ID，score 是他的考试成绩。我们可以对成绩按分数进行排序就可以得到他的名次。

```
> zadd books 9.0 "think in java"
(integer) 1
> zadd books 8.9 "java concurrency"
(integer) 1
> zadd books 8.6 "java cookbook"
(integer) 1
> zrange books 0 -1  # 按 score 排序列出，参数区间为排名范围
1) "java cookbook"
2) "java concurrency"
3) "think in java"
> zrevrange books 0 -1  # 按 score 逆序列出，参数区间为排名范围
1) "think in java"
2) "java concurrency"
3) "java cookbook"
> zcard books  # 相当于 count()
(integer) 3
> zscore books "java concurrency"  # 获取指定 value 的 score
"8.9000000000000004"  # 内部 score 使用 double 类型进行存储，所以存在小数点精度问题
> zrank books "java concurrency"  # 排名
(integer) 1
> zrangebyscore books 0 8.91  # 根据分值区间遍历 zset
1) "java cookbook"
2) "java concurrency"
> zrangebyscore books -inf 8.91 withscores # 根据分值区间 (-∞, 8.91] 遍历 zset，同时返回分值。inf 代表 infinite，无穷大的意思。
1) "java cookbook"
2) "8.5999999999999996"
3) "java concurrency"
4) "8.9000000000000004"
> zrem books "java concurrency"  # 删除 value
(integer) 1
> zrange books 0 -1
1) "java cookbook"
2) "think in java"
```

